#include <iostream>
#include <Windows.h>
using namespace std;
int main()
{
    SetConsoleOutputCP(1251);
    SetConsoleCP(1251);
    /*Завдання 1. Користувач вводить з клавіатури символ.
Визначити, який це символ: літера, цифра, знак пунктуації або інше.*/
   
    

   /*Завдання 2. Написати програму підрахунку вартості
розмови для різних мобільних операторів. Користувач
вводить вартість розмови і вибирає, з якого на який оператор він дзвонить. 
Вивести вартість на екран*/
/*Перше рішення
    float value,value1,value2,choose,choose1;

    cout << "Введіть вартість розмови для лайфсела: ";
    cin >> value;
     cout << "Введіть вартість розмови для київстара: ";
    cin >> value1;
     cout << "Введіть вартість розмови для водафона: ";
    cin >> value2;
    cout << "Виберіть на якого оператора Ви телефонуєте : \n\a";
    cout << "1 - для київстар, 2 - для лайфселл, 3 - для водафон : ";
    cin >> choose;
    cout << "Введіть з якого оператора Ви дзвоните : \n\a";
    cout << "4 - для київстар, 5 - для лайфселл, 6 - для водафон : ";
    cin >> choose1;

    cout << "Вартість розмови для лайфсела  = "<<value<<""<<"грн";
    cout << "Вартість розмови для київстара = "<<value1<<""<<"грн";
    cout << "Вартість розмови для водафона  = "<<value2<<""<<"грн";
    */
/*Друге рішення
    float choose,choose1,layf,kiy,voda;
    

    cout << "Введіть вартість розмови по київстару  1 хвилину в грн : ";
    cin >> kiy;
    cout << "Введіть вартість розмови по водафону  1 хвилину в грн  : ";
    cin >> voda;
    cout << "Введіть вартість розмови по лайфселу  1 хвилину в грн  : ";
    cin >> layf;
    cout << "Виберіть на якого оператора Ви телефонуєте : \n\a";
    cout << "1 - для київстар, 2 - для лайфселл, 3 - для водафон : ";
    cin >> choose;
    cout << "Введіть з якого оператора Ви дзвоните : \n\a";
    cout << "4 - для київстар, 5 - для лайфселл, 6 - для водафон : ";
    cin >> choose1;
    if (choose == 1 and choose1==4)
    {
       cout << "Ви дзвоните з київстару на київстар ";
    }
   else if (choose == 2 and choose1== 5)
    {
        cout << "Ви дзвоните з лайфселу на лайфселл ";
    }
    else if (choose == 3 and choose1 == 6)
    {
        cout << "Ви дзвоните з водафона на водафон ";
    }
    if (choose == 1 and choose1 == 5)
    {
        cout << "Ви дзвоните з лайфселла на київстар ";
    }
    if (choose == 1 and choose1 == 6)
    {
        cout << "Ви дзвоните з водафону на київстар ";
    }
    if (choose == 2 and choose1 == 4)
    {
        cout << "Ви дзвоните з київстару на лафселл ";
    }
    if (choose == 2 and choose1 == 6)
    {
        cout << "Ви дзвоните з водафону на лайфселл ";
    }
    if (choose == 3 and choose1 == 4)
    {
        cout << "Ви дзвоните з київстару на водафон ";
    }
    if (choose == 3 and choose1 == 5)
    {
        cout << "Ви дзвоните з лафйселла на водафон ";
    }
    
    cout << "\n\n";
    cout << "Вартість розмови київстаром за 1 хв  = "<<kiy<<""<<"грн" << "\n";
    cout << "Вартість розмови київстаром за 1 год = "<<kiy*60 << "" << "грн" << "\n";
    cout << "Вартість розмови лайфселом за 1 хв   = "<<layf << "" << "грн" << "\n";
    cout << "Вартість розмови лафйселом за 1 год  = "<<layf*60 << "" << "грн" << "\n";
    cout << "Вартість розмови водафоном за 1 хв   = "<<voda << "" << "грн" << "\n";
    cout << "Вартість розмови водафоном за 1 год  = "<<voda*60 << "" << "грн" << "\n";
    

    return 0;
    */

/*Завдання 3. Вася працює програмістом та отримує 50$
за кожні 100 рядків коду. За кожне третє запізнення Васю
штрафують на 20$. Реалізувати меню:
■ користувач вводить бажаний дохід Васі та кількість
запізнень, порахувати, скільки рядків коду йому треба
написати;
■ користувач вводить кількість рядків коду, написані
Васею та бажаний обсяг зарплати. Порахувати, скільки
разів Вася може запізнитися;
■ користувач вводить кількість рядків коду та кількість
запізнень, визначити, скільки грошей заплатять Васі
і чи заплатять взагалі.*/
/*
int dohid, zapiznenya, radky,in,dohid2,zap,radk,choise,second,third;

cout << "\t\tВиберiть та введiть номер варiанту\n";
cout << "1 Введiть бажаний дохiд Васi та кiлькiсть запiзнень : \n";
cout << "2 Введыть кiлькiсть рядкiв коду, написаны Васею i бажаний обсяг зарплати : \n";
cout << "3 Введыть кiлькiсть рядкiв коду i кiлькiсть запiзнень :\n";
cin >> choise;
if (choise < 1 or choise>3)  cout << "ПОМИЛКА\n";
else  if (choise == 1)
{
    cout << "Введіть бажаний дохід Василя : ";
    cin >> dohid;
    cout << "Введіть скільки разів Василь запізнився : ";
    cin >> zapiznenya;

    radky = (dohid * 2);
    in = dohid - zapiznenya / 3 * 20;
    cout << "Щоб заробити " << "" << dohid << "$ " << "треба написати " << "" << radky << " рядків коду\n";
    cout << "Василь заробить : " << in << "" << "$";
}
else if (choise == 2)
{
    cout << "Введіть кількість рядків коду написані Василем : ";
    cin >> radk;
    cout << "Введіть бажану заробітню плату яку отримає Василь : ";
    cin >> dohid2;
    if (radk / 2 <= dohid2)
        cout << "Не можна пропускати\n";
    else
        cout << (radk / 2 - dohid2) / 20 << " разів можна пропустити\n";
}
else if (choise==3)
{
    cout << "Введiть кiлькiсть рядкiв коду\n";
    cin >> radk;
    cout << "Введiть кiлькiсть запiзнень\n";
    cin >> zapiznenya;
    second = ((radk / 2) - (zapiznenya / 3 * 20));
    third = second / 20;
    if (third > 0)
        cout <<"Заробітня плата Василя у цьому місяці = " << second << " $\n";
    else 
        cout << "Василь не отримає заробітню плату в цьому місяці!\n";
}

*/

}

